---
type: CylindricalHelix
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# CylindricalHelix

`Autodesk.Revit.DB.CylindricalHelix` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `public static CylindricalHelix Create ( XYZ basePoint , double radius , XYZ xVector , XYZ zVector , double pitch , double startAngle , double endAngle )` |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Property | BasePoint | — | `public XYZ BasePoint { get ; }` |
| Property | Height | — | `public double Height { get ; }` |
| Property | IsRightHanded | — | `public bool IsRightHanded { get ; }` |
| Property | Pitch | — | `public double Pitch { get ; }` |
| Property | Radius | — | `public double Radius { get ; }` |
| Property | XVector | — | `public XYZ XVector { get ; }` |
| Property | YVector | — | `public XYZ YVector { get ; }` |
| Property | ZVector | — | `public XYZ ZVector { get ; }` |